app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
    def homepage
        @pages = Page.all